'''
This is an intro mission, the purpose of which is to explain how to solve missions on CheckiO
and how to get the most out of solving them. When the mission is solved, one more station
become available for you, containing more complex missions.

So this mission is the easiest one. Write a function that will receive 2 numbers as input and it
should return the multiplication of these 2 numbers.

Input: Two arguments. Both are int
Output: Int.


Это вводная миссия, целью которой является показать как решать задачи на CheckiO
или как получить максимум от этого. Когда эта миссия будет решена еще одна станция
будет доступна, с чуть более сложными миссиями.

Итак, это самая простая миссия. Напишите функцию, которая будет получать 2 числа и возвращать
результат произведения этих чисел.

Входные данные: Два аргумента. Оба int
Выходные данные: Int.
'''

def mult_two(a: int, b: int) -> int:
    return a*b
print(mult_two(20,3))