'''
Задача 4 - Smallest multiple
2520 - самое маленькое число, которое делится без остатка на все числа от 1 до 10.

Какое самое маленькое число делится нацело на все числа от 1 до 20?
'''
'''
Алгоритм:
1) находим все простые числа на отрезке от 2 до n (Решето Эратосфена)
2) составные числа раскладываем на простые
3) выбираем числа с максимальным числом повторений каждого простого числа 
4) перемножаем полученные простые числа  
Пример: 2-10
2*  2 (1)
3*  3 (1)
4   2х2 (2)
5*  5 (1)
6   2х3 (1)(1)
7*  7 (1)
8   2х2х2 (3)
9   3х3 (2)
10  2х5 (1)(1)
1) простые числа: 2, 3, 5, 7
2) максимальные повторения: 2(3), 3(2), 5(1), 7(1)
3) m = 2520 = 2х2х2 х 3х3 х 5 х 7
------------------------------
Пример: 2-20
2*  2(1)
3*  3(1)
4   2х2 (2)
5*  5(1)
6   2х3(1)(1)
7*  7(1)
8   2х2х2(3)
9   3х3(2)
10  2х5(1)(1)
11* 11(1)
12  2х2х3(2)(1)
13* 13(1)
14  2х7(1)(1)
15  3х5(1)(1)
16  2х2х2х2(4)
17* 17(1)
18  2х3х3(1)(2)
19* 19(1)
20  2х2х5(2)(1) 
1) простые числа: 2, 3, 5, 7, 11, 13, 17, 19
2) максимальные повторения: 2(4), 3(2), 5(1), 7(1), 11(1), 13(1), 17(1), 19(1)
3) m = 232792560 = 2х2х2х2 х 3х3 х 5 х 7 х 11 х 13 х 17 х 19
'''
#Делители
def smallest_divisor(n):
    list = []
    for i in range(2, n):
        if n % i == 0:
            list.append(i)
    return list

#tests
print(smallest_divisor(10))
print(smallest_divisor(9))
print(smallest_divisor(8))
print(smallest_divisor(7))
print(smallest_divisor(6))
print(smallest_divisor(5))
print(smallest_divisor(4))
print(smallest_divisor(3))
print(smallest_divisor(2))
print(smallest_divisor(1))
